<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#style-rows" data-toc-modified-id="style-rows-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>style rows</a></span></li><li><span><a href="#style-columns" data-toc-modified-id="style-columns-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>style columns</a></span></li><li><span><a href="#style-diagonal" data-toc-modified-id="style-diagonal-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>style diagonal</a></span></li><li><span><a href="#style-rows-and-columns" data-toc-modified-id="style-rows-and-columns-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>style rows and columns</a></span></li><li><span><a href="#style-rows,-columns-and-diagonals" data-toc-modified-id="style-rows,-columns-and-diagonals-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>style rows, columns and diagonals</a></span></li><li><span><a href="#style-cell-using-value" data-toc-modified-id="style-cell-using-value-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>style cell using value</a></span></li><li><span><a href="#style-cell-using-dataframe-as-x" data-toc-modified-id="style-cell-using-dataframe-as-x-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>style cell using dataframe as x</a></span></li><li><span><a href="#Style-rows-based-on-values-of-a-column" data-toc-modified-id="Style-rows-based-on-values-of-a-column-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Style rows based on values of a column</a></span></li></ul></div>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
# my local library
import sys
from pathlib import Path
import platform

if platform.system() == 'Windows':
    p = Path("~/OneDrive - AmerisourceBergen(ABC)/bhishan").expanduser()
elif platform.system() == 'Darwin':
    p = Path.home() / "Dropbox/a00_Bhishan_Modules"
sys.path.append(str(p))
from bhishan import bp

In [3]:
df = pd.DataFrame({'A':[10,20,30],
            'B':['USA','Japan','Germany'],
            'C': [100,200,300],
             'D': ['Washington','Tokyo','Brussles']})

df.index = df.index + 100

df

      A        B    C           D
100  10      USA  100  Washington
101  20    Japan  200       Tokyo
102  30  Germany  300    Brussles

In [4]:
df2 = df.copy()
df2.index = list('abc')
df2

    A        B    C           D
a  10      USA  100  Washington
b  20    Japan  200       Tokyo
c  30  Germany  300    Brussles

# style rows

In [5]:
def _style_rows(df,rows=None,colors='lightblue'):
    # if df is Styler, make it dataframe
    if isinstance(df,pd.io.formats.style.Styler):
        df = df.data

    # if rows is None, make it first index
    if rows is None:
        rows = [df.index[0]]

    # if cols is integer or str, make it list
    if type(rows) in [int,str]:
        rows = [rows]

    # if index name is not integer, use integer to get nth index
    if not isinstance(df.index[0],int):
        if isinstance(rows[0], int):
            rows = list(df.index[rows])

    # create colors
    if colors is None:
        colors = ['salmon'] * len(rows)

    # if color is string, make list
    if isinstance(colors,str):
        colors = [colors]*len(rows)

    df_str = pd.DataFrame("", index=df.index, columns=df.columns)

    for row,color in zip(rows,colors):
        attr = f"background-color: {color}"
        if row in df.index:
            df_str.loc[row,:] = attr
    return df_str

In [6]:
df_str = _style_rows(df)

display(df)
display(df_str)

print(df.shape)
print(df_str.shape)

df_style = df.style.apply(_style_rows, axis=None)
df_style

      A        B    C           D
100  10      USA  100  Washington
101  20    Japan  200       Tokyo
102  30  Germany  300    Brussles

,A,B,C,D
100,background-color: lightblue,background-color: lightblue,background-color: lightblue,background-color: lightblue
101,,,,
102,,,,

(3, 4)
(3, 4)

In [7]:
df.style.apply(_style_rows, axis=None,rows=101)

In [8]:
df.style.apply(_style_rows, axis=None,rows=0)

In [9]:
df2.style.apply(_style_rows, axis=None,rows=0)

In [10]:
bp.style_rows(df,0)

ERROR: '0' is not in Index.

In [11]:
bp.style_rows(df,1)

ERROR: '1' is not in Index.

In [12]:
bp.style_rows(df2,0)

In [13]:
bp.style_rows(df2,'a')

In [14]:
titanic = sns.load_dataset('titanic')
titanic = titanic.head()
dfmi = titanic.groupby(['sex', 'class']).agg({'fare': ['sum','count']})
dfmi

                   fare
                    sum count
sex    class
female First   124.3833     2
       Second    0.0000     0
       Third     7.9250     1
male   First     0.0000     0
       Second    0.0000     0
       Third    15.3000     2

In [15]:
bp.style_row_mi(dfmi,('male','Second'))

In [16]:
bp.style_row_mi(dfmi,('male','*'))

# style columns

In [17]:
def _style_cols(df,cols=None,colors='salmon'):
    # if df is Styler, make it dataframe
    if isinstance(df,pd.io.formats.style.Styler):
        df = df.data

    # if cols is None, make it first column
    if cols is None:
        cols = [df.columns[0]]

    # if cols is integer or str, make it list
    if type(cols) in [int,str]:
        cols = [cols]

    # if column name is not integer, use integer to get nth column
    if not isinstance(df.columns[0],int):
        if isinstance(cols[0], int):
            cols = list(df.columns[cols])

    # create colors
    if colors is None:
        colors = ['salmon'] * len(cols)

    # if color is string, make list
    if isinstance(colors,str):
        colors = [colors]*len(cols)

    df_str = pd.DataFrame("", index=df.index, columns=df.columns)

    for col,color in zip(cols,colors):
        attr = f"background-color: {color}"
        if col in df.columns:
            df_str.loc[:, col] = attr
    return df_str

In [18]:
df_str = _style_cols(df)

display(df)
display(df_str)

print(df.shape)
print(df_str.shape)

df_style = df.style.apply(_style_cols, axis=None,cols=1)
df_style

      A        B    C           D
100  10      USA  100  Washington
101  20    Japan  200       Tokyo
102  30  Germany  300    Brussles

                            A B C D
100  background-color: salmon
101  background-color: salmon
102  background-color: salmon

(3, 4)
(3, 4)

In [19]:
bp.style_cols(df,0)

In [20]:
bp.style_cols(df,1)

In [21]:
bp.style_cols(df,'C')

# style diagonal

In [22]:
bp.style_diags(df)

In [23]:
bp.style_diags(df,diag='second')

# style rows and columns

In [24]:
df

      A        B    C           D
100  10      USA  100  Washington
101  20    Japan  200       Tokyo
102  30  Germany  300    Brussles

In [25]:
bp.style_rowscols(df,rows=100,cols=2)

# style rows, columns and diagonals

In [26]:
def _style_rows(
    df,
    rows=None,
    colors='lightblue'
    ):
    # if df is Styler, make it dataframe
    if isinstance(df,pd.io.formats.style.Styler):
        df = df.data

    # if rows is None, make it first index
    if rows is None:
        rows = [df.index[0]]

    # if cols is integer or str, make it list
    if type(rows) in [int,str]:
        rows = [rows]

    # if index name is not integer, use integer to get nth index
    if not isinstance(df.index[0],int):
        if isinstance(rows[0], int):
            rows = list(df.index[rows])

    # create colors
    if colors is None:
        colors = ['salmon'] * len(rows)

    # if color is string, make list
    if isinstance(colors,str):
        colors = [colors]*len(rows)

    df_str = pd.DataFrame("", index=df.index, columns=df.columns)

    for row,color in zip(rows,colors):
        attr = f"background-color: {color}"
        if row not in df.index:
            print(f"ERROR: '{row}' is not in Index.")
        if row in df.index:
            df_str.loc[row,:] = attr
    return df_str

In [27]:
def _style_cols(
    df,
    cols=None,
    colors='salmon'
    ):
    # if df is Styler, make it dataframe
    if isinstance(df,pd.io.formats.style.Styler):
        df = df.data

    # if cols is None, make it first column
    if cols is None:
        cols = [df.columns[0]]

    # if cols is integer or str, make it list
    if type(cols) in [int,str]:
        cols = [cols]

    # if column name is not integer, use integer to get nth column
    if not isinstance(df.columns[0],int):
        if isinstance(cols[0], int):
            cols = list(df.columns[cols])

    # create colors
    if colors is None:
        colors = ['salmon'] * len(cols)

    # if color is string, make list
    if isinstance(colors,str):
        colors = [colors]*len(cols)

    df_str = pd.DataFrame("", index=df.index, columns=df.columns)

    for col,color in zip(cols,colors):
        attr = f"background-color: {color}"
        if col not in df.columns:
            print(f"ERROR: '{col}' is not in Columns.")
        if col in df.columns:
            df_str.loc[:, col] = attr
    return df_str

In [28]:
def _style_diags(
    df,
    diag='both',
    c1='lightgreen',
    c2='salmon'
    ):
    # colors
    attr1 = f'background-color: {c1}'
    attr2 = f'background-color: {c2}'

    # empty array
    arr_str = np.full(df.shape, '', dtype='<U32')

    # main diagonal
    if diag==0 or str(diag).startswith('f'):
        np.fill_diagonal(arr_str, attr1)

    # second diagonal
    if diag==1 or str(diag).startswith('s'):
        np.fill_diagonal(np.flipud(arr_str), attr2)

    # both
    if diag==2 or diag=='both':
        np.fill_diagonal(np.flipud(arr_str), attr2)
        np.fill_diagonal(arr_str, attr1)

    # df style
    df_str = pd.DataFrame(arr_str, index=df.index, columns=df.columns)

    return df_str

In [29]:
c1 = 'lightblue'
c2 = 'salmon'
c3 = 'yellow'
rows = 100
cols = 0
diag = 0


(df.style
    .apply(_style_rows, axis=None, colors=c1, rows=rows)
    .apply(_style_cols, axis=None, colors=c2, cols=cols)
    .apply(_style_diags, axis=None, diag=0)
)

In [30]:
bp.style_rcd(df)

ERROR: '-1' is not in Index.

In [31]:
bp.style_rcd(df2,diag=0)

# style cell using value

In [32]:
df = sns.load_dataset('titanic')
df1 = df.head()
df1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [33]:
cond = "type(v) in [int,float] and 1<=v<=3"

bp.style_cellv(df1, cond)

In [34]:
bp.style_cellv(df1, "v==1",idx=2)

In [35]:
cond = "v in [3,'S']"
bp.style_cellv(df1,cond)

In [36]:
bp.style_cellv(df1, "v==1",col='pclass')

# style cell using dataframe as x

In [37]:
df1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [38]:
cond = "x.age==35"
bp.style_cellx(df1,cond)

In [39]:
cond = "x[x.index==2]==0"
bp.style_cellx(df1,cond)

In [40]:
cond = "x==1"
bp.style_cellx(df1,cond)

In [41]:
df1.bp.style_cellx("x==1")

In [42]:
bp.style_cellx(df1,"x['survived']==x['pclass']")

# Style rows based on values of a column

In [43]:
mydf = pd.DataFrame({
    'id': [0,0,0,1,1,2,2,3],
    'dummy': np.random.randint(0,100,size=8)
})

bp.style_rows_colvals(mydf,'id',vals=[0])

In [44]:
# (titanic.style
# .apply(lambda ser: ['background: red'if (ser['pclass'] == 1) else '' for _ in ser], axis=1)
# )

In [45]:
bp.style_rows_colvals(titanic, 'pclass',vals=[1],sort=True)